# AddTileGeometryObject

## Description
Adds the specified object to the specified tile resource.

```pascal
FUNCTION AddTileGeometryObject(
				tileHandle   : HANDLE;
				objectHandle : HANDLE) : BOOLEAN;
```

```python

def vs.AddTileGeometryObject(tileHandle, objectHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The handle to the tile resource.|
|objectHandle|HANDLE|The handle to the object to add.|

## Returns
TRUE if a valid object was successfully added; FALSE otherwise.

## Examples
```pascal
return := AddTileGeometryGroup(tileHandle, objectHandle);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Document Attributes